#include<iostream>
using namespace std;

int main(){
    int list_name[10]={};
    int sum=0;
    for(int s=1;s<=9;s++){
        cin >> list_name[s];
        sum+=list_name[s];
    } // sum > 100 ;
    for (int i = 1; i <= 9; i++) {// i
    for (int j = i + 1; j <= 9; j++) { // j
      if (sum - 100 == list_name[i] + list_name[j]) { // 140-100 == i + j
      // ผลรวม 100 เหลือ 40 หมายความมี มี 2 ตัวที่ บวกแล้ว ได้ 40 2 ตัวนั้นคือ ตัวปลอม
        // ถ้าเข้าเงื่อนไขนี้มาได้แสดงว่าเจอตำแหน่งที่ไม่ต้องปริ้นแล้วคือค่าของ j กับ k
        for (int k = 1; k <= 9; ++k) { // รู้ i,j ที่ บวกแล้ว ได้ 40 มาลูปต่อ
          if (k == i || k == j) { // ถ้า k = i , k = j ที่บวกแล้ว่ ได้เ40 ก็ ให้ผ่านไป จะปริ้นตัวที่เหลือ
            // เช็คว่าตำแหน่งที่ k คือตำแหน่ง i หรือ j ก็ข้ามรอบไป ไม่ต้องปริ้นอะไร
            continue;
          }
          cout << list_name[k] << "\n";
        
        }

        // หลังจากปริ้นแล้วก็จบโปรแกรม
        return 0;
      }
    }
  }
    


    
    return 0;
}


